# ExportDWGSettings Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings Class
Members See Also
---
This element contains DWG/DXF export settings which are saved in a Revit document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ExportDWGSettings : Element
```

Visual Basic
---
```text
Public Class ExportDWGSettings _
	Inherits Element
```

Visual C++
---
```text
public ref class ExportDWGSettings : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ExportDWGSettings
# See Also
ExportDWGSettings Members
Autodesk.Revit.DB Namespace